Tekla Open API Reference for Tekla Structures 2025
TaskDependency.DependencyTypeEnum Enumeration
 The task dependency types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DependencyTypeEnum
Public Enumeration DependencyTypeEnum
Members
Member name | Value | Description
FINISH_TO_FINISH | 0 |  The task dependency type finish-to-finish.
FINISH_TO_START | 1 |  The task dependency type finish-to-start.
START_TO_FINISH | 2 |  The task dependency type start-to-finish.
START_TO_START | 3 |  The task dependency type start-to-start.
See Also
Reference
Tekla.Structures.Model Namespace